# Import Library

In [76]:
import pandas as pd
import numpy as np

# Series

## Create Series

There are many approaches to create a Series.  We first create a Series with 5 elements from a list:

Index | Data (int)
:---: | :---:
0 | 14
1 | -8
2 | 0
3 | 3
4 | 9

Note that **integer index starts from 0**

In [77]:
# create Series from a list
s1 = pd.Series([14, -8, 0, 3, 9])
s1

0    14
1    -8
2     0
3     3
4     9
dtype: int64

In [78]:
type(s1)

pandas.core.series.Series

In [79]:
s1.dtype

dtype('int64')

In [80]:
s1.values

array([14, -8,  0,  3,  9], dtype=int64)

In [81]:
s1.index

RangeIndex(start=0, stop=5, step=1)

In [82]:
#Get value in index 0
print(s1[0])
print(s1[2])

14
0

## Create Series with Index

We can create a Series with labels as index.  A label can be an arbitary string.  Although, we assign labels to the Series, integer index still exists.

Index | Label | Data (int)
:---: | :---: | :---:
0 | d | 14
1 | b | -8
2 | a | 0
3 | c | 3
4 | x | 9

Note that when we display a Series, it will show labels (if exist) or integer index (otherwise).

In [83]:
# create series with index, which can be numbers or strings
s2 = pd.Series([14, -8, 0, 3, 9], index=['d','a','b','c', 'x'])
s2

d    14
a    -8
b     0
c     3
x     9
dtype: int64

In [84]:
s2.index

Index(['d', 'a', 'b', 'c', 'x'], dtype='object')

In [85]:
#Get value in index 'a'
print(s2['a'])
print(s2[1])

-8
-8

# Series Operation

In [86]:
s2.values

array([14, -8,  0,  3,  9], dtype=int64)

In [87]:
# Apply with Lambda
s2.apply(lambda x : x**2)

d    196
a     64
b      0
c      9
x     81
dtype: int64

In [88]:
# Apply with method
def power(x):
    return x**2
s2.apply(power)

d    196
a     64
b      0
c      9
x     81
dtype: int64

In [89]:
s2

d    14
a    -8
b     0
c     3
x     9
dtype: int64

# DataFrame

## Create DataFrame from List

There are several approaches to create a DataFrame.  A simple one is to create from dict.
We create the following DataFrame:

Index | province | year | population
:---: | :---: | :---: | :---:
0 | Chiang Mai | 2016 | 1630428
1 | Chiang Mai | 2017 | 1664012
2 | Chiang Mai | 2018 | 1687971
3 | Phrae | 2016 | 398936
4 | Phrae | 2017 | 410382
5 | Phrae | 2018 | 421653

In [90]:
# Create From a List
data = [
    ['Chiang Mai', 2016, 1630428],
    ['Chiang Mai', 2017, 1664012],
    ['Chiang Mai', 2018, 1687971],
    ['Phrae', 2016, 398936],
    ['Phrae', 2017, 410382],
    ['Phrae', 2018, 421653]
]
df = pd.DataFrame(
    data=data,
    columns=['province','year','population']
)
df

     province  year  population
0  Chiang Mai  2016     1630428
1  Chiang Mai  2017     1664012
2  Chiang Mai  2018     1687971
3       Phrae  2016      398936
4       Phrae  2017      410382
5       Phrae  2018      421653

In [91]:
# Create From a Dict
data = {
    'province': ['Chiang Mai', 'Chiang Mai', 'Chiang Mai', 'Phrae', 'Phrae', 'Phrae'],
    'year': [2016, 2017, 2018, 2016, 2017, 2018],
    'population': [1630428, 1664012, 1687971, 398936, 410382, 421653]
}
df = pd.DataFrame(data)
df

     province  year  population
0  Chiang Mai  2016     1630428
1  Chiang Mai  2017     1664012
2  Chiang Mai  2018     1687971
3       Phrae  2016      398936
4       Phrae  2017      410382
5       Phrae  2018      421653

In [92]:
# Pandas to List
df.values.tolist()

[['Chiang Mai', 2016, 1630428],
 ['Chiang Mai', 2017, 1664012],
 ['Chiang Mai', 2018, 1687971],
 ['Phrae', 2016, 398936],
 ['Phrae', 2017, 410382],
 ['Phrae', 2018, 421653]]

## Create DataFrame from File

### Download Data

### Read File

In [93]:
df = pd.read_csv('https://github.com/kaopanboonyuen/2110446_DataScience_2021s2/raw/main/datasets/sample.csv')
df

     province  year  population
0  Chiang Mai  2016     1630428
1  Chiang Mai  2017     1664012
2  Chiang Mai  2018     1687971
3       Phrae  2016      398936
4       Phrae  2017      410382
5       Phrae  2018      421653

In [94]:
df = pd.read_excel('https://github.com/kaopanboonyuen/2110446_DataScience_2021s2/raw/main/datasets/sample.xlsx', sheet_name='sheet1')
df

     province  year  population
0  Chiang Mai  2016     1630428
1  Chiang Mai  2017     1664012
2  Chiang Mai  2018     1687971
3       Phrae  2016      398936
4       Phrae  2017      410382
5       Phrae  2018      421653

In [95]:
df2 = pd.read_sas('https://github.com/kaopanboonyuen/2110446_DataScience_2021s2/raw/main/datasets/pva97nk.sas7bdat')
df2

,TARGET_B,ID,TARGET_D,GiftCnt36,GiftCntAll,GiftCntCard36,GiftCntCardAll,GiftAvgLast,GiftAvg36,GiftAvgAll,...,PromCntCardAll,StatusCat96NK,StatusCatStarAll,DemCluster,DemAge,DemGender,DemHomeOwner,DemMedHomeValue,DemPctVeterans,DemMedIncome
0,0.0,b'00014974',NaN,2.0,4.0,1.0,3.0,17.0,13.50,9.25,...,13.0,b'A',0.0,b'00',NaN,b'F',b'U',0.0,0.0,0.0
1,0.0,b'00006294',NaN,1.0,8.0,0.0,3.0,20.0,20.00,15.88,...,24.0,b'A',0.0,b'23',67.0,b'F',b'U',186800.0,85.0,0.0
2,1.0,b'00046110',4.0,6.0,41.0,3.0,20.0,6.0,5.17,3.73,...,22.0,b'S',1.0,b'00',NaN,b'M',b'U',87600.0,36.0,38750.0
3,1.0,b'00185937',10.0,3.0,12.0,3.0,8.0,10.0,8.67,8.50,...,16.0,b'E',1.0,b'00',NaN,b'M',b'U',139200.0,27.0,38942.0
4,0.0,b'00029637',NaN,1.0,1.0,1.0,1.0,20.0,20.00,20.00,...,6.0,b'F',0.0,b'35',53.0,b'M',b'U',168100.0,37.0,71509.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9681,1.0,b'00002796',25.0,2.0,2.0,2.0,2.0,10.0,15.00,15.00,...,11.0,b'N',0.0,b'44',NaN,b'M',b'H',68200.0,38.0,45909.0
9682,0.0,b'00184939',NaN,3.0,4.0,1.0,1.0,10.0,13.33,11.50,...,13.0,b'A',0.0,b'44',NaN,b'U',b'H',71900.0,35.0,50530.0
9683,1.0,b'00184974',10.0,9.0,14.0,5.0,7.0,10.0,8.78,7.71,...,18.0,b'S',1.0,b'40',71.0,b'F',b'H',115700.0,32.0,0.0
9684,0.0,b'00184994',NaN,2.0,7.0,0.0,1.0,5.0,12.50,7.43,...,16.0,b'A',0.0,b'40',NaN,b'M',b'H',106300.0,32.0,62717.0
9685,0.0,b'00001928',NaN,8.0,15.0,7.0,10.0,5.0,4.88,4.53,...,21.0,b'A',1.0,b'38',81.0,b'F',b'H',110400.0,36.0,59813.0

### Write File

In [96]:
df.to_csv('sample_test.csv', index=False)

In [97]:
df.to_excel('sample_test.xlsx', sheet_name='sheet1', index=False)

## Index

In [98]:
# Index
df.set_index('province')

            year  population
province
Chiang Mai  2016     1630428
Chiang Mai  2017     1664012
Chiang Mai  2018     1687971
Phrae       2016      398936
Phrae       2017      410382
Phrae       2018      421653

In [99]:
# Index
df2 = df.set_index(['province','year'])
df2

                 population
province   year
Chiang Mai 2016     1630428
           2017     1664012
           2018     1687971
Phrae      2016      398936
           2017      410382
           2018      421653

In [100]:
df2.reset_index()

     province  year  population
0  Chiang Mai  2016     1630428
1  Chiang Mai  2017     1664012
2  Chiang Mai  2018     1687971
3       Phrae  2016      398936
4       Phrae  2017      410382
5       Phrae  2018      421653

## Inspecting Data

### Row

#### View

In [101]:
df.head(3)

     province  year  population
0  Chiang Mai  2016     1630428
1  Chiang Mai  2017     1664012
2  Chiang Mai  2018     1687971

In [102]:
df.tail(3)

  province  year  population
3    Phrae  2016      398936
4    Phrae  2017      410382
5    Phrae  2018      421653

#### Sample

In [103]:
#Random
display(df.sample(3))
display(df.sample(3))

     province  year  population
3       Phrae  2016      398936
2  Chiang Mai  2018     1687971
0  Chiang Mai  2016     1630428

     province  year  population
0  Chiang Mai  2016     1630428
4       Phrae  2017      410382
1  Chiang Mai  2017     1664012

In [104]:
#Random with fix random_state
display(df.sample(3, random_state = 123))
display(df.sample(3, random_state = 123))

     province  year  population
1  Chiang Mai  2017     1664012
3       Phrae  2016      398936
4       Phrae  2017      410382

     province  year  population
1  Chiang Mai  2017     1664012
3       Phrae  2016      398936
4       Phrae  2017      410382

#### Get Some Rows

In [105]:
df2 = df.set_index(['province'])
df2

            year  population
province
Chiang Mai  2016     1630428
Chiang Mai  2017     1664012
Chiang Mai  2018     1687971
Phrae       2016      398936
Phrae       2017      410382
Phrae       2018      421653

In [106]:
# Index Position
df2.iloc[0]

year             2016
population    1630428
Name: Chiang Mai, dtype: int64

In [107]:
# Index Position
df2.iloc[1:4]

            year  population
province
Chiang Mai  2017     1664012
Chiang Mai  2018     1687971
Phrae       2016      398936

In [108]:
# Index name
df2.loc['Chiang Mai']

            year  population
province
Chiang Mai  2016     1630428
Chiang Mai  2017     1664012
Chiang Mai  2018     1687971

In [109]:
# Index name
df2.loc[['Chiang Mai','Phrae']]

            year  population
province
Chiang Mai  2016     1630428
Chiang Mai  2017     1664012
Chiang Mai  2018     1687971
Phrae       2016      398936
Phrae       2017      410382
Phrae       2018      421653

### Column

In [110]:
df.columns

Index(['province', 'year', 'population'], dtype='object')

In [111]:
columns_list = ['year','population']
df[columns_list]

   year  population
0  2016     1630428
1  2017     1664012
2  2018     1687971
3  2016      398936
4  2017      410382
5  2018      421653

In [112]:
df.year

0    2016
1    2017
2    2018
3    2016
4    2017
5    2018
Name: year, dtype: int64

#### Drop

In [113]:
df.drop(columns=['province'])

   year  population
0  2016     1630428
1  2017     1664012
2  2018     1687971
3  2016      398936
4  2017      410382
5  2018      421653

In [114]:
df

     province  year  population
0  Chiang Mai  2016     1630428
1  Chiang Mai  2017     1664012
2  Chiang Mai  2018     1687971
3       Phrae  2016      398936
4       Phrae  2017      410382
5       Phrae  2018      421653

#### Rename

In [115]:
mapper = {
    'province':'Province',
    'year':'Year',
    'population':'Population'
}
df.rename(columns=mapper)

     Province  Year  Population
0  Chiang Mai  2016     1630428
1  Chiang Mai  2017     1664012
2  Chiang Mai  2018     1687971
3       Phrae  2016      398936
4       Phrae  2017      410382
5       Phrae  2018      421653

#### Create/Replace Column with Value/Array

In [116]:
df['source'] = 'A'
df

     province  year  population source
0  Chiang Mai  2016     1630428      A
1  Chiang Mai  2017     1664012      A
2  Chiang Mai  2018     1687971      A
3       Phrae  2016      398936      A
4       Phrae  2017      410382      A
5       Phrae  2018      421653      A

In [117]:
df['source'] = ['A','B','A','C','A','B']
df

     province  year  population source
0  Chiang Mai  2016     1630428      A
1  Chiang Mai  2017     1664012      B
2  Chiang Mai  2018     1687971      A
3       Phrae  2016      398936      C
4       Phrae  2017      410382      A
5       Phrae  2018      421653      B

In [118]:
df['population (K)'] = df['population'] / 1000
df

     province  year  population source  population (K)
0  Chiang Mai  2016     1630428      A        1630.428
1  Chiang Mai  2017     1664012      B        1664.012
2  Chiang Mai  2018     1687971      A        1687.971
3       Phrae  2016      398936      C         398.936
4       Phrae  2017      410382      A         410.382
5       Phrae  2018      421653      B         421.653

In [119]:
df['population (K)'] = df['population'].apply(lambda x : x / 1000)
df

     province  year  population source  population (K)
0  Chiang Mai  2016     1630428      A        1630.428
1  Chiang Mai  2017     1664012      B        1664.012
2  Chiang Mai  2018     1687971      A        1687.971
3       Phrae  2016      398936      C         398.936
4       Phrae  2017      410382      A         410.382
5       Phrae  2018      421653      B         421.653

In [120]:
# extra example
import math
df2 = df.copy()
# df2 = df # this will be error since it refers to address (not copy values)
df['LN population'] = df['population'].apply(math.log)
df2

     province  year  population source  population (K)
0  Chiang Mai  2016     1630428      A        1630.428
1  Chiang Mai  2017     1664012      B        1664.012
2  Chiang Mai  2018     1687971      A        1687.971
3       Phrae  2016      398936      C         398.936
4       Phrae  2017      410382      A         410.382
5       Phrae  2018      421653      B         421.653

### DataFrame Information

In [121]:
type(df)

pandas.core.frame.DataFrame

In [122]:
df.shape

(6, 6)

In [123]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   province        6 non-null      object
 1   year            6 non-null      int64
 2   population      6 non-null      int64
 3   source          6 non-null      object
 4   population (K)  6 non-null      float64
 5   LN population   6 non-null      float64
dtypes: float64(2), int64(2), object(2)
memory usage: 416.0+ bytes

In [124]:
df.dtypes

province           object
year                int64
population          int64
source             object
population (K)    float64
LN population     float64
dtype: object

## Filtering and Sorting

### Filtering

In [125]:
condition_list = [True,True,True,True,True,True]
df[condition_list]

     province  year  population source  population (K)  LN population
0  Chiang Mai  2016     1630428      A        1630.428      14.304353
1  Chiang Mai  2017     1664012      B        1664.012      14.324742
2  Chiang Mai  2018     1687971      A        1687.971      14.339038
3       Phrae  2016      398936      C         398.936      12.896556
4       Phrae  2017      410382      A         410.382      12.924844
5       Phrae  2018      421653      B         421.653      12.951938

In [126]:
condition_list = [True,False,True,False,True,False]
df[condition_list]

     province  year  population source  population (K)  LN population
0  Chiang Mai  2016     1630428      A        1630.428      14.304353
2  Chiang Mai  2018     1687971      A        1687.971      14.339038
4       Phrae  2017      410382      A         410.382      12.924844

In [127]:
condition_list = df['province'] == 'Chiang Mai'
print(condition_list)
display(df[condition_list])

0     True
1     True
2     True
3    False
4    False
5    False
Name: province, dtype: bool

     province  year  population source  population (K)  LN population
0  Chiang Mai  2016     1630428      A        1630.428      14.304353
1  Chiang Mai  2017     1664012      B        1664.012      14.324742
2  Chiang Mai  2018     1687971      A        1687.971      14.339038

In [128]:
condition_list = df['population'] > 1000000
print(condition_list)
display(df[condition_list])

0     True
1     True
2     True
3    False
4    False
5    False
Name: population, dtype: bool

     province  year  population source  population (K)  LN population
0  Chiang Mai  2016     1630428      A        1630.428      14.304353
1  Chiang Mai  2017     1664012      B        1664.012      14.324742
2  Chiang Mai  2018     1687971      A        1687.971      14.339038

In [129]:
# Multiple condition (and)
condition_list = (df['province'] == 'Chiang Mai') & (df['population'] > 1000000)
print(condition_list)
display(df[condition_list])

0     True
1     True
2     True
3    False
4    False
5    False
dtype: bool

     province  year  population source  population (K)  LN population
0  Chiang Mai  2016     1630428      A        1630.428      14.304353
1  Chiang Mai  2017     1664012      B        1664.012      14.324742
2  Chiang Mai  2018     1687971      A        1687.971      14.339038

In [130]:
# Multiple condition (or)
condition_list = (df['province'] == 'Chiang Mai') | (df['population'] > 1000000)
print(condition_list)
display(df[condition_list])

0     True
1     True
2     True
3    False
4    False
5    False
dtype: bool

     province  year  population source  population (K)  LN population
0  Chiang Mai  2016     1630428      A        1630.428      14.304353
1  Chiang Mai  2017     1664012      B        1664.012      14.324742
2  Chiang Mai  2018     1687971      A        1687.971      14.339038

### Sorting

In [131]:
df.sort_values(by='population')

     province  year  population source  population (K)  LN population
3       Phrae  2016      398936      C         398.936      12.896556
4       Phrae  2017      410382      A         410.382      12.924844
5       Phrae  2018      421653      B         421.653      12.951938
0  Chiang Mai  2016     1630428      A        1630.428      14.304353
1  Chiang Mai  2017     1664012      B        1664.012      14.324742
2  Chiang Mai  2018     1687971      A        1687.971      14.339038

In [132]:
df.sort_values(by='population', ascending=False)

     province  year  population source  population (K)  LN population
2  Chiang Mai  2018     1687971      A        1687.971      14.339038
1  Chiang Mai  2017     1664012      B        1664.012      14.324742
0  Chiang Mai  2016     1630428      A        1630.428      14.304353
5       Phrae  2018      421653      B         421.653      12.951938
4       Phrae  2017      410382      A         410.382      12.924844
3       Phrae  2016      398936      C         398.936      12.896556

In [133]:
df.sort_values(by=['year','population'], ascending=[True,False])

     province  year  population source  population (K)  LN population
0  Chiang Mai  2016     1630428      A        1630.428      14.304353
3       Phrae  2016      398936      C         398.936      12.896556
1  Chiang Mai  2017     1664012      B        1664.012      14.324742
4       Phrae  2017      410382      A         410.382      12.924844
2  Chiang Mai  2018     1687971      A        1687.971      14.339038
5       Phrae  2018      421653      B         421.653      12.951938

In [134]:
df3=df.sort_values(by=['year','population'], ascending=[True,False])

In [135]:
df3

     province  year  population source  population (K)  LN population
0  Chiang Mai  2016     1630428      A        1630.428      14.304353
3       Phrae  2016      398936      C         398.936      12.896556
1  Chiang Mai  2017     1664012      B        1664.012      14.324742
4       Phrae  2017      410382      A         410.382      12.924844
2  Chiang Mai  2018     1687971      A        1687.971      14.339038
5       Phrae  2018      421653      B         421.653      12.951938

## Basic Statistic

**Descriptive and summary statistics methods**
- **count** <br> Number of non-NA values
- **describe** <br> Compute set of summary statistics for Series or each DataFrame column
- **min, max** <br> Compute minimum and maximum values
- **argmin, argmax** <br> Compute index locations (integers) at which minimum or maximum value obtained, respectively
- **idxmin, idxmax** <br> Compute index labels at which minimum or maximum value obtained, respectively
- **quantile** <br> Compute sample quantile ranging from 0 to 1
- **sum** <br> Sum of values
- **mean** <br> Mean of values
- **median** <br> Arithmetic median (50% quantile) of values
- **mad** <br> Mean absolute deviation from mean value
- **prod** <br> Product of all values
- **var** <br> Sample variance of values
- **std** <br> Sample standard deviation of values
- **skew** <br> Sample skewness (third moment) of values
- **kurt** <br> Sample kurtosis (fourth moment) of values
- **cumsum** <br> Cumulative sum of values
- **cummin, cummax** <br> Cumulative minimum or maximum of values, respectively
- **cumprod** <br> Cumulative product of values
- **diff** <br> Compute first arithmetic difference (useful for time series)
- **pct_change** <br> Compute percent changes

### Numeric

In [136]:
# Find Mean in all numeric columns
df.mean(numeric_only=True)

year              2.017000e+03
population        1.035564e+06
population (K)    1.035564e+03
LN population     1.362358e+01
dtype: float64

In [137]:
# Find Mean in some column
df['population'].mean()

1035563.6666666666

In [138]:
# Find Mean in some column
column_list = ['population','population (K)']
df[column_list].mean()

population        1.035564e+06
population (K)    1.035564e+03
dtype: float64

In [139]:
df[column_list].count()

population        6
population (K)    6
dtype: int64

In [140]:
df[column_list].min()

population        398936.000
population (K)       398.936
dtype: float64

In [141]:
df[column_list].max()

population        1687971.000
population (K)       1687.971
dtype: float64

In [142]:
df[column_list].median()

population        1.026040e+06
population (K)    1.026041e+03
dtype: float64

In [143]:
df[column_list].std()

population        685197.697059
population (K)       685.197697
dtype: float64

In [144]:
df[column_list].corr()

                population  population (K)
population             1.0             1.0
population (K)         1.0             1.0

In [145]:
df.quantile(0.75,numeric_only=True)

year              2.017750e+03
population        1.655616e+06
population (K)    1.655616e+03
LN population     1.431964e+01
Name: 0.75, dtype: float64

### Object

In [146]:
df['province'].unique()

array(['Chiang Mai', 'Phrae'], dtype=object)

In [147]:
df['province'].nunique()

2

In [148]:
df['province'].value_counts()

Chiang Mai    3
Phrae         3
Name: province, dtype: int64

### Describe

In [149]:
#Numeric
df[columns_list].describe()

              year    population
count     6.000000  6.000000e+00
mean   2017.000000  1.035564e+06
std       0.894427  6.851977e+05
min    2016.000000  3.989360e+05
25%    2016.250000  4.131998e+05
50%    2017.000000  1.026040e+06
75%    2017.750000  1.655616e+06
max    2018.000000  1.687971e+06

In [150]:
#Category
df.describe(include=object)

          province source
count            6      6
unique           2      3
top     Chiang Mai      A
freq             3      3

In [151]:
df.describe(include='all')

,province,year,population,source,population (K),LN population
count,6,6.000000,6.000000e+00,6,6.000000,6.000000
unique,2,NaN,NaN,3,NaN,NaN
top,Chiang Mai,NaN,NaN,A,NaN,NaN
freq,3,NaN,NaN,3,NaN,NaN
mean,NaN,2017.000000,1.035564e+06,NaN,1035.563667,13.623578
std,NaN,0.894427,6.851977e+05,NaN,685.197697,0.766141
min,NaN,2016.000000,3.989360e+05,NaN,398.936000,12.896556
25%,NaN,2016.250000,4.131998e+05,NaN,413.199750,12.931617
50%,NaN,2017.000000,1.026040e+06,NaN,1026.040500,13.628146
75%,NaN,2017.750000,1.655616e+06,NaN,1655.616000,14.319645
max,NaN,2018.000000,1.687971e+06,NaN,1687.971000,14.339038

## Grouping

### Group by

**Optimized groupby methods**
- **count** <BR> Number of non-NA values in the group
- **sum** <BR> Sum of non-NA values
- **mean** <BR> Mean of non-NA values
- **median** <BR> Arithmetic median of non-NA values
- **std, var** <BR> Unbiased (n – 1 denominator) standard deviation and variance
- **min, max** <BR> Minimum and maximum of non-NA values
- **prod** <BR> Product of non-NA values
- **first, last** <BR> First and last non-NA values

In [152]:
# select avg(population) from df group by province
df.groupby('province')['population'].mean()

province
Chiang Mai    1.660804e+06
Phrae         4.103237e+05
Name: population, dtype: float64

In [153]:
# Convert to DataFrame
df.groupby('province')['population'].mean().reset_index(name='avg_pop')

     province       avg_pop
0  Chiang Mai  1.660804e+06
1       Phrae  4.103237e+05

#### Multiple group by

In [154]:
mapper = {
    'population' : 'mean'
}

df.groupby('province').agg(mapper)

              population
province
Chiang Mai  1.660804e+06
Phrae       4.103237e+05

In [155]:
mapper = {
    'population' : ['min','max','mean']
}

df.groupby('province').agg(mapper)

           population
                  min      max          mean
province
Chiang Mai    1630428  1687971  1.660804e+06
Phrae          398936   421653  4.103237e+05

In [156]:
mapper = {
    'population' : ['min','max','mean'],
    'source' : 'nunique'
}

df.groupby('province').agg(mapper)

           population                         source
                  min      max          mean nunique
province
Chiang Mai    1630428  1687971  1.660804e+06       2
Phrae          398936   421653  4.103237e+05       3

### Group by window

In [157]:
df['population'].rolling(2).sum()

0          NaN
1    3294440.0
2    3351983.0
3    2086907.0
4     809318.0
5     832035.0
Name: population, dtype: float64

In [158]:
df['population'].rolling(2, min_periods=1).sum()

0    1630428.0
1    3294440.0
2    3351983.0
3    2086907.0
4     809318.0
5     832035.0
Name: population, dtype: float64

In [159]:
df.groupby('province')['population'].rolling(2, min_periods=1).sum().reset_index(name='avg_pop_last2year')

     province  level_1  avg_pop_last2year
0  Chiang Mai        0          1630428.0
1  Chiang Mai        1          3294440.0
2  Chiang Mai        2          3351983.0
3       Phrae        3           398936.0
4       Phrae        4           809318.0
5       Phrae        5           832035.0

## Pivot

### Pivot

In [160]:
df

     province  year  population source  population (K)  LN population
0  Chiang Mai  2016     1630428      A        1630.428      14.304353
1  Chiang Mai  2017     1664012      B        1664.012      14.324742
2  Chiang Mai  2018     1687971      A        1687.971      14.339038
3       Phrae  2016      398936      C         398.936      12.896556
4       Phrae  2017      410382      A         410.382      12.924844
5       Phrae  2018      421653      B         421.653      12.951938

In [161]:
pivot = df.pivot_table(index=['province'], columns=['year'], values=['population'])
pivot

           population
year             2016     2017     2018
province
Chiang Mai    1630428  1664012  1687971
Phrae          398936   410382   421653

In [162]:
pivot.columns = ['{1}'.format(col[0],col[1]) for col in pivot.columns.values]
pivot = pivot.reset_index()
pivot

     province     2016     2017     2018
0  Chiang Mai  1630428  1664012  1687971
1       Phrae   398936   410382   421653

### Melt

In [163]:
melt = pd.melt(pivot, id_vars=['province'], value_vars=['2016','2017','2018'])
melt

     province variable    value
0  Chiang Mai     2016  1630428
1       Phrae     2016   398936
2  Chiang Mai     2017  1664012
3       Phrae     2017   410382
4  Chiang Mai     2018  1687971
5       Phrae     2018   421653

In [164]:
mapper = {
    'variable':'year',
    'value':'population'
}
melt = melt.rename(columns=mapper)
melt

     province  year  population
0  Chiang Mai  2016     1630428
1       Phrae  2016      398936
2  Chiang Mai  2017     1664012
3       Phrae  2017      410382
4  Chiang Mai  2018     1687971
5       Phrae  2018      421653

## Data Cleansing

In [165]:
# Create From a List
data = [
    ['Chiang Mai', 2016, 1630428],
    ['Chiang Mai', 2017, 1664012],
    ['Chiang Mai', 2018, 1687971],
    ['Phrae', 2016, None],
    ['Phrae', 2017, 410382],
    [None, 2018, 421653]
]
df = pd.DataFrame(
    data=data,
    columns=['province','year','population']
)
df

     province  year  population
0  Chiang Mai  2016   1630428.0
1  Chiang Mai  2017   1664012.0
2  Chiang Mai  2018   1687971.0
3       Phrae  2016         NaN
4       Phrae  2017    410382.0
5        None  2018    421653.0

### Find Null

In [166]:
df.isnull()

   province   year  population
0     False  False       False
1     False  False       False
2     False  False       False
3     False  False        True
4     False  False       False
5      True  False       False

In [167]:
df.isna()

   province   year  population
0     False  False       False
1     False  False       False
2     False  False       False
3     False  False        True
4     False  False       False
5      True  False       False

In [168]:
df.isnull().sum()

province      1
year          0
population    1
dtype: int64

### Drop NA

In [169]:
df.dropna()

     province  year  population
0  Chiang Mai  2016   1630428.0
1  Chiang Mai  2017   1664012.0
2  Chiang Mai  2018   1687971.0
4       Phrae  2017    410382.0

In [170]:
df.dropna(subset = ['province'])

     province  year  population
0  Chiang Mai  2016   1630428.0
1  Chiang Mai  2017   1664012.0
2  Chiang Mai  2018   1687971.0
3       Phrae  2016         NaN
4       Phrae  2017    410382.0

In [171]:
df # to show that all commands don't replace (remind)

     province  year  population
0  Chiang Mai  2016   1630428.0
1  Chiang Mai  2017   1664012.0
2  Chiang Mai  2018   1687971.0
3       Phrae  2016         NaN
4       Phrae  2017    410382.0
5        None  2018    421653.0

### Fill NA

In [172]:
df.fillna('Missing')

     province  year population
0  Chiang Mai  2016  1630428.0
1  Chiang Mai  2017  1664012.0
2  Chiang Mai  2018  1687971.0
3       Phrae  2016    Missing
4       Phrae  2017   410382.0
5     Missing  2018   421653.0

In [173]:
mapper = {
    'province' : 'Unknown',
    'population' : df['population'].mean()
}
print(mapper)
display(df.fillna(mapper))

{'province': 'Unknown', 'population': 1162889.2}

     province  year  population
0  Chiang Mai  2016   1630428.0
1  Chiang Mai  2017   1664012.0
2  Chiang Mai  2018   1687971.0
3       Phrae  2016   1162889.2
4       Phrae  2017    410382.0
5     Unknown  2018    421653.0

## Append and Join

### Append

In [174]:
# Create From a List
data = [
    ['Chiang Mai', 2016, 1630428],
    ['Chiang Mai', 2017, 1664012],
    ['Chiang Mai', 2018, 1687971],
]
df1 = pd.DataFrame(
    data=data,
    columns=['province','year','population']
)
df1

     province  year  population
0  Chiang Mai  2016     1630428
1  Chiang Mai  2017     1664012
2  Chiang Mai  2018     1687971

In [175]:
# Create From a List
data = [
    ['Phrae', 2016, 398936],
    ['Phrae', 2017, 410382],
    ['Phrae', 2018, 421653]
]
df2 = pd.DataFrame(
    data=data,
    columns=['province','year','population']
)
df2

  province  year  population
0    Phrae  2016      398936
1    Phrae  2017      410382
2    Phrae  2018      421653

In [176]:
df = pd.concat([df1, df2])
df

     province  year  population
0  Chiang Mai  2016     1630428
1  Chiang Mai  2017     1664012
2  Chiang Mai  2018     1687971
0       Phrae  2016      398936
1       Phrae  2017      410382
2       Phrae  2018      421653

In [177]:
df2 = pd.concat([df1, df2], axis=1)
df2

     province  year  population province  year  population
0  Chiang Mai  2016     1630428    Phrae  2016      398936
1  Chiang Mai  2017     1664012    Phrae  2017      410382
2  Chiang Mai  2018     1687971    Phrae  2018      421653

### Join

In [178]:
df

     province  year  population
0  Chiang Mai  2016     1630428
1  Chiang Mai  2017     1664012
2  Chiang Mai  2018     1687971
0       Phrae  2016      398936
1       Phrae  2017      410382
2       Phrae  2018      421653

In [179]:
avg_df = df.groupby('province')['population'].mean().reset_index(name='avg_pop')
avg_df

     province       avg_pop
0  Chiang Mai  1.660804e+06
1       Phrae  4.103237e+05

In [180]:
df.dtypes

province      object
year           int64
population     int64
dtype: object

In [181]:
avg_df.dtypes

province     object
avg_pop     float64
dtype: object

In [182]:
df.merge(avg_df, on = 'province', how = 'inner')

     province  year  population       avg_pop
0  Chiang Mai  2016     1630428  1.660804e+06
1  Chiang Mai  2017     1664012  1.660804e+06
2  Chiang Mai  2018     1687971  1.660804e+06
3       Phrae  2016      398936  4.103237e+05
4       Phrae  2017      410382  4.103237e+05
5       Phrae  2018      421653  4.103237e+05

## SQL

In [183]:
!pip install pandasql

Looking in indexes: https://pypi.org/simple, https://pypi.ngc.nvidia.com

DEPRECATION: markdown 3.3.5 has a non-standard dependency specifier importlib-metadata>='4.4'; python_version < "3.10". pip 24.0 will enforce this behaviour change. A possible replacement is to upgrade to a newer version of markdown or contact the author to suggest that they release a version with a conforming dependency specifiers. Discussion can be found at https://github.com/pypa/pip/issues/12063

[notice] A new release of pip is available: 23.3.1 -> 24.2
[notice] To update, run: C:\Users\Om\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.9_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

Collecting pandasql
  Downloading pandasql-0.7.3.tar.gz (26 kB)
  Preparing metadata (setup.py): started
  Preparing metadata (setup.py): finished with status 'done'
Requirement already satisfied: numpy in c:\users\om\appdata\local\packages\pythonsoftwarefoundation.python.3.9_qbz5n2kfra8p0\localcache\local-packages\python39\site-packages (from pandasql) (1.26.1)
Requirement already satisfied: pandas in c:\users\om\appdata\local\packages\pythonsoftwarefoundation.python.3.9_qbz5n2kfra8p0\localcache\local-packages\python39\site-packages (from pandasql) (1.3.5)
Requirement already satisfied: sqlalchemy in c:\users\om\appdata\local\packages\pythonsoftwarefoundation.python.3.9_qbz5n2kfra8p0\localcache\local-packages\python39\site-packages (from pandasql) (1.4.45)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\om\appdata\local\packages\pythonsoftwarefoundation.python.3.9_qbz5n2kfra8p0\localcache\local-packages\python39\site-packages (from pandas->pandasql) (2.8.2)
Requirement already satisfied: pytz>=2017.3 in c:\users\om\appdata\local\packages\pythonsoftwarefoundation.python.3.9_qbz5n2kfra8p0\localcache\local-packages\python39\site-packages (from pandas->pandasql) (2021.3)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\om\appdata\local\packages\pythonsoftwarefoundation.python.3.9_qbz5n2kfra8p0\localcache\local-packages\python39\site-packages (from sqlalchemy->pandasql) (2.0.1)
Requirement already satisfied: six>=1.5 in c:\users\om\appdata\local\packages\pythonsoftwarefoundation.python.3.9_qbz5n2kfra8p0\localcache\local-packages\python39\site-packages (from python-dateutil>=2.7.3->pandas->pandasql) (1.16.0)
Building wheels for collected packages: pandasql
  Building wheel for pandasql (setup.py): started
  Building wheel for pandasql (setup.py): finished with status 'done'
  Created wheel for pandasql: filename=pandasql-0.7.3-py3-none-any.whl size=26781 sha256=56824746e04b11e7e76e3389ab1c9574d6f75a99633f2590a33f1a6dc781a1a8
  Stored in directory: C:\Users\Om\AppData\Local\Temp\pip-ephem-wheel-cache-p7vhbt1q\wheels\63\e8\ec\75b1df467ecf57b6ececb32cb16f4e86697cbfe55cb0c51f07
Successfully built pandasql
Installing collected packages: pandasql
Successfully installed pandasql-0.7.3

In [184]:
import pandasql

In [185]:
sql_df = pandasql.sqldf("SELECT * FROM df;")
sql_df

     province  year  population
0  Chiang Mai  2016     1630428
1  Chiang Mai  2017     1664012
2  Chiang Mai  2018     1687971
3       Phrae  2016      398936
4       Phrae  2017      410382
5       Phrae  2018      421653

In [186]:
sql_df = pandasql.sqldf("select province, avg(population) from df group by province;")
sql_df

     province  avg(population)
0  Chiang Mai     1.660804e+06
1       Phrae     4.103237e+05